03_Training/PH_gen100_pop20_symUVKRxy_parIs_p003_added_feats/running_pfac150_pop20_seed0/run_00786/PH_2D_RANS_kOmegaSSTx/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          160;
        startFace       63640;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          160;
        startFace       63800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       63960;
    }
    hills
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       64160;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32000;
        startFace       64360;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32000;
        startFace       96360;
    }
)

// ************************************************************************* //
